analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/uart_regs.h
#define MXC_F_UART_CTRL0_PARITY_MODE_POS               2 /**< CTRL0_PARITY_MODE Position */
#define MXC_F_UART_CTRL0_PARITY_MODE                   ((uint32_t)(0x3UL << MXC_F_UART_CTRL0_PARITY_MODE_POS)) /**< CTRL0_PARITY_MODE Mask */
#define MXC_V_UART_CTRL0_PARITY_MODE_EVEN              ((uint32_t)0x0UL) /**< CTRL0_PARITY_MODE_EVEN Value */
#define MXC_S_UART_CTRL0_PARITY_MODE_EVEN              (MXC_V_UART_CTRL0_PARITY_MODE_EVEN << MXC_F_UART_CTRL0_PARITY_MODE_POS) /**< CTRL0_PARITY_MODE_EVEN Setting */
#define MXC_V_UART_CTRL0_PARITY_MODE_ODD               ((uint32_t)0x1UL) /**< CTRL0_PARITY_MODE_ODD Value */
#define MXC_S_UART_CTRL0_PARITY_MODE_ODD               (MXC_V_UART_CTRL0_PARITY_MODE_ODD << MXC_F_UART_CTRL0_PARITY_MODE_POS) /**< CTRL0_PARITY_MODE_ODD Setting */
#define MXC_V_UART_CTRL0_PARITY_MODE_MARK              ((uint32_t)0x2UL) /**< CTRL0_PARITY_MODE_MARK Value */
#define MXC_S_UART_CTRL0_PARITY_MODE_MARK              (MXC_V_UART_CTRL0_PARITY_MODE_MARK << MXC_F_UART_CTRL0_PARITY_MODE_POS) /**< CTRL0_PARITY_MODE_MARK Setting */
#define MXC_V_UART_CTRL0_PARITY_MODE_SPACE             ((uint32_t)0x3UL) /**< CTRL0_PARITY_MODE_SPACE Value */
#define MXC_S_UART_CTRL0_PARITY_MODE_SPACE             (MXC_V_UART_CTRL0_PARITY_MODE_SPACE << MXC_F_UART_CTRL0_PARITY_MODE_POS) /**< CTRL0_PARITY_MODE_SPACE Setting */

#define MXC_F_UART_CTRL0_PARITY_LVL_POS                4 /**< CTRL0_PARITY_LVL Position */
#define MXC_F_UART_CTRL0_PARITY_LVL                    ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_PARITY_LVL_POS)) /**< CTRL0_PARITY_LVL Mask */
#define MXC_V_UART_CTRL0_PARITY_LVL_ZERO               ((uint32_t)0x0UL) /**< CTRL0_PARITY_LVL_ZERO Value */
#define MXC_S_UART_CTRL0_PARITY_LVL_ZERO               (MXC_V_UART_CTRL0_PARITY_LVL_ZERO << MXC_F_UART_CTRL0_PARITY_LVL_POS) /**< CTRL0_PARITY_LVL_ZERO Setting */
#define MXC_V_UART_CTRL0_PARITY_LVL_ONE                ((uint32_t)0x1UL) /**< CTRL0_PARITY_LVL_ONE Value */
#define MXC_S_UART_CTRL0_PARITY_LVL_ONE                (MXC_V_UART_CTRL0_PARITY_LVL_ONE << MXC_F_UART_CTRL0_PARITY_LVL_POS) /**< CTRL0_PARITY_LVL_ONE Setting */

#define MXC_F_UART_CTRL0_TXFLUSH_POS                   5 /**< CTRL0_TXFLUSH Position */
#define MXC_F_UART_CTRL0_TXFLUSH                       ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_TXFLUSH_POS)) /**< CTRL0_TXFLUSH Mask */
#define MXC_V_UART_CTRL0_TXFLUSH_NOP                   ((uint32_t)0x0UL) /**< CTRL0_TXFLUSH_NOP Value */
#define MXC_S_UART_CTRL0_TXFLUSH_NOP                   (MXC_V_UART_CTRL0_TXFLUSH_NOP << MXC_F_UART_CTRL0_TXFLUSH_POS) /**< CTRL0_TXFLUSH_NOP Setting */
#define MXC_V_UART_CTRL0_TXFLUSH_FLUSH                 ((uint32_t)0x1UL) /**< CTRL0_TXFLUSH_FLUSH Value */
#define MXC_S_UART_CTRL0_TXFLUSH_FLUSH                 (MXC_V_UART_CTRL0_TXFLUSH_FLUSH << MXC_F_UART_CTRL0_TXFLUSH_POS) /**< CTRL0_TXFLUSH_FLUSH Setting */

#define MXC_F_UART_CTRL0_RXFLUSH_POS                   6 /**< CTRL0_RXFLUSH Position */
#define MXC_F_UART_CTRL0_RXFLUSH                       ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_RXFLUSH_POS)) /**< CTRL0_RXFLUSH Mask */
#define MXC_V_UART_CTRL0_RXFLUSH_NOP                   ((uint32_t)0x0UL) /**< CTRL0_RXFLUSH_NOP Value */
#define MXC_S_UART_CTRL0_RXFLUSH_NOP                   (MXC_V_UART_CTRL0_RXFLUSH_NOP << MXC_F_UART_CTRL0_RXFLUSH_POS) /**< CTRL0_RXFLUSH_NOP Setting */
#define MXC_V_UART_CTRL0_RXFLUSH_FLUSH                 ((uint32_t)0x1UL) /**< CTRL0_RXFLUSH_FLUSH Value */
#define MXC_S_UART_CTRL0_RXFLUSH_FLUSH                 (MXC_V_UART_CTRL0_RXFLUSH_FLUSH << MXC_F_UART_CTRL0_RXFLUSH_POS) /**< CTRL0_RXFLUSH_FLUSH Setting */

#define MXC_F_UART_CTRL0_BITACC_POS                    7 /**< CTRL0_BITACC Position */
#define MXC_F_UART_CTRL0_BITACC                        ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_BITACC_POS)) /**< CTRL0_BITACC Mask */
#define MXC_V_UART_CTRL0_BITACC_FRAME                  ((uint32_t)0x0UL) /**< CTRL0_BITACC_FRAME Value */
#define MXC_S_UART_CTRL0_BITACC_FRAME                  (MXC_V_UART_CTRL0_BITACC_FRAME << MXC_F_UART_CTRL0_BITACC_POS) /**< CTRL0_BITACC_FRAME Setting */
#define MXC_V_UART_CTRL0_BITACC_BIT                    ((uint32_t)0x1UL) /**< CTRL0_BITACC_BIT Value */
#define MXC_S_UART_CTRL0_BITACC_BIT                    (MXC_V_UART_CTRL0_BITACC_BIT << MXC_F_UART_CTRL0_BITACC_POS) /**< CTRL0_BITACC_BIT Setting */

#define MXC_F_UART_CTRL0_SIZE_POS                      8 /**< CTRL0_SIZE Position */
#define MXC_F_UART_CTRL0_SIZE                          ((uint32_t)(0x3UL << MXC_F_UART_CTRL0_SIZE_POS)) /**< CTRL0_SIZE Mask */
#define MXC_V_UART_CTRL0_SIZE_5BIT_DATA                ((uint32_t)0x0UL) /**< CTRL0_SIZE_5BIT_DATA Value */
#define MXC_S_UART_CTRL0_SIZE_5BIT_DATA                (MXC_V_UART_CTRL0_SIZE_5BIT_DATA << MXC_F_UART_CTRL0_SIZE_POS) /**< CTRL0_SIZE_5BIT_DATA Setting */
#define MXC_V_UART_CTRL0_SIZE_6BIT_DATA                ((uint32_t)0x1UL) /**< CTRL0_SIZE_6BIT_DATA Value */
#define MXC_S_UART_CTRL0_SIZE_6BIT_DATA                (MXC_V_UART_CTRL0_SIZE_6BIT_DATA << MXC_F_UART_CTRL0_SIZE_POS) /**< CTRL0_SIZE_6BIT_DATA Setting */
#define MXC_V_UART_CTRL0_SIZE_7BIT_DATA                ((uint32_t)0x2UL) /**< CTRL0_SIZE_7BIT_DATA Value */
#define MXC_S_UART_CTRL0_SIZE_7BIT_DATA                (MXC_V_UART_CTRL0_SIZE_7BIT_DATA << MXC_F_UART_CTRL0_SIZE_POS) /**< CTRL0_SIZE_7BIT_DATA Setting */
#define MXC_V_UART_CTRL0_SIZE_8BIT_DATA                ((uint32_t)0x3UL) /**< CTRL0_SIZE_8BIT_DATA Value */
#define MXC_S_UART_CTRL0_SIZE_8BIT_DATA                (MXC_V_UART_CTRL0_SIZE_8BIT_DATA << MXC_F_UART_CTRL0_SIZE_POS) /**< CTRL0_SIZE_8BIT_DATA Setting */

#define MXC_F_UART_CTRL0_STOP_POS                      10 /**< CTRL0_STOP Position */
#define MXC_F_UART_CTRL0_STOP                          ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_STOP_POS)) /**< CTRL0_STOP Mask */
#define MXC_V_UART_CTRL0_STOP_1_STOPBITS               ((uint32_t)0x0UL) /**< CTRL0_STOP_1_STOPBITS Value */
#define MXC_S_UART_CTRL0_STOP_1_STOPBITS               (MXC_V_UART_CTRL0_STOP_1_STOPBITS << MXC_F_UART_CTRL0_STOP_POS) /**< CTRL0_STOP_1_STOPBITS Setting */
#define MXC_V_UART_CTRL0_STOP_2_STOPBITS               ((uint32_t)0x1UL) /**< CTRL0_STOP_2_STOPBITS Value */
#define MXC_S_UART_CTRL0_STOP_2_STOPBITS               (MXC_V_UART_CTRL0_STOP_2_STOPBITS << MXC_F_UART_CTRL0_STOP_POS) /**< CTRL0_STOP_2_STOPBITS Setting */

