analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/uart_regs.h
#define MXC_F_UART_CTRL0_FLOW_POS                      11 /**< CTRL0_FLOW Position */
#define MXC_F_UART_CTRL0_FLOW                          ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_FLOW_POS)) /**< CTRL0_FLOW Mask */
#define MXC_V_UART_CTRL0_FLOW_DIS                      ((uint32_t)0x0UL) /**< CTRL0_FLOW_DIS Value */
#define MXC_S_UART_CTRL0_FLOW_DIS                      (MXC_V_UART_CTRL0_FLOW_DIS << MXC_F_UART_CTRL0_FLOW_POS) /**< CTRL0_FLOW_DIS Setting */
#define MXC_V_UART_CTRL0_FLOW_EN                       ((uint32_t)0x1UL) /**< CTRL0_FLOW_EN Value */
#define MXC_S_UART_CTRL0_FLOW_EN                       (MXC_V_UART_CTRL0_FLOW_EN << MXC_F_UART_CTRL0_FLOW_POS) /**< CTRL0_FLOW_EN Setting */

#define MXC_F_UART_CTRL0_FLOWPOL_POS                   12 /**< CTRL0_FLOWPOL Position */
#define MXC_F_UART_CTRL0_FLOWPOL                       ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_FLOWPOL_POS)) /**< CTRL0_FLOWPOL Mask */
#define MXC_V_UART_CTRL0_FLOWPOL_ACTIVE_LOW            ((uint32_t)0x0UL) /**< CTRL0_FLOWPOL_ACTIVE_LOW Value */
#define MXC_S_UART_CTRL0_FLOWPOL_ACTIVE_LOW            (MXC_V_UART_CTRL0_FLOWPOL_ACTIVE_LOW << MXC_F_UART_CTRL0_FLOWPOL_POS) /**< CTRL0_FLOWPOL_ACTIVE_LOW Setting */
#define MXC_V_UART_CTRL0_FLOWPOL_ACTIVE_HIGH           ((uint32_t)0x1UL) /**< CTRL0_FLOWPOL_ACTIVE_HIGH Value */
#define MXC_S_UART_CTRL0_FLOWPOL_ACTIVE_HIGH           (MXC_V_UART_CTRL0_FLOWPOL_ACTIVE_HIGH << MXC_F_UART_CTRL0_FLOWPOL_POS) /**< CTRL0_FLOWPOL_ACTIVE_HIGH Setting */

#define MXC_F_UART_CTRL0_NULLMOD_POS                   13 /**< CTRL0_NULLMOD Position */
#define MXC_F_UART_CTRL0_NULLMOD                       ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_NULLMOD_POS)) /**< CTRL0_NULLMOD Mask */
#define MXC_V_UART_CTRL0_NULLMOD_NORMAL                ((uint32_t)0x0UL) /**< CTRL0_NULLMOD_NORMAL Value */
#define MXC_S_UART_CTRL0_NULLMOD_NORMAL                (MXC_V_UART_CTRL0_NULLMOD_NORMAL << MXC_F_UART_CTRL0_NULLMOD_POS) /**< CTRL0_NULLMOD_NORMAL Setting */
#define MXC_V_UART_CTRL0_NULLMOD_SWAPPED               ((uint32_t)0x1UL) /**< CTRL0_NULLMOD_SWAPPED Value */
#define MXC_S_UART_CTRL0_NULLMOD_SWAPPED               (MXC_V_UART_CTRL0_NULLMOD_SWAPPED << MXC_F_UART_CTRL0_NULLMOD_POS) /**< CTRL0_NULLMOD_SWAPPED Setting */

#define MXC_F_UART_CTRL0_BREAK_POS                     14 /**< CTRL0_BREAK Position */
#define MXC_F_UART_CTRL0_BREAK                         ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_BREAK_POS)) /**< CTRL0_BREAK Mask */
#define MXC_V_UART_CTRL0_BREAK_NORMAL                  ((uint32_t)0x0UL) /**< CTRL0_BREAK_NORMAL Value */
#define MXC_S_UART_CTRL0_BREAK_NORMAL                  (MXC_V_UART_CTRL0_BREAK_NORMAL << MXC_F_UART_CTRL0_BREAK_POS) /**< CTRL0_BREAK_NORMAL Setting */
#define MXC_V_UART_CTRL0_BREAK_BREAK                   ((uint32_t)0x1UL) /**< CTRL0_BREAK_BREAK Value */
#define MXC_S_UART_CTRL0_BREAK_BREAK                   (MXC_V_UART_CTRL0_BREAK_BREAK << MXC_F_UART_CTRL0_BREAK_POS) /**< CTRL0_BREAK_BREAK Setting */

#define MXC_F_UART_CTRL0_CLK_SEL_POS                   15 /**< CTRL0_CLK_SEL Position */
#define MXC_F_UART_CTRL0_CLK_SEL                       ((uint32_t)(0x1UL << MXC_F_UART_CTRL0_CLK_SEL_POS)) /**< CTRL0_CLK_SEL Mask */
#define MXC_V_UART_CTRL0_CLK_SEL_PERIPH_CLK            ((uint32_t)0x0UL) /**< CTRL0_CLK_SEL_PERIPH_CLK Value */
#define MXC_S_UART_CTRL0_CLK_SEL_PERIPH_CLK            (MXC_V_UART_CTRL0_CLK_SEL_PERIPH_CLK << MXC_F_UART_CTRL0_CLK_SEL_POS) /**< CTRL0_CLK_SEL_PERIPH_CLK Setting */
#define MXC_V_UART_CTRL0_CLK_SEL_ALT_CLK               ((uint32_t)0x1UL) /**< CTRL0_CLK_SEL_ALT_CLK Value */
#define MXC_S_UART_CTRL0_CLK_SEL_ALT_CLK               (MXC_V_UART_CTRL0_CLK_SEL_ALT_CLK << MXC_F_UART_CTRL0_CLK_SEL_POS) /**< CTRL0_CLK_SEL_ALT_CLK Setting */

#define MXC_F_UART_CTRL0_TO_CNT_POS                    16 /**< CTRL0_TO_CNT Position */
#define MXC_F_UART_CTRL0_TO_CNT                        ((uint32_t)(0xFFUL << MXC_F_UART_CTRL0_TO_CNT_POS)) /**< CTRL0_TO_CNT Mask */

/**@} end of group UART_CTRL0_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_CTRL1 UART_CTRL1
 * @brief    Threshold Control register.
 * @{
 */
#define MXC_F_UART_CTRL1_RX_FIFO_LVL_POS               0 /**< CTRL1_RX_FIFO_LVL Position */
#define MXC_F_UART_CTRL1_RX_FIFO_LVL                   ((uint32_t)(0x3FUL << MXC_F_UART_CTRL1_RX_FIFO_LVL_POS)) /**< CTRL1_RX_FIFO_LVL Mask */

#define MXC_F_UART_CTRL1_TX_FIFO_LVL_POS               8 /**< CTRL1_TX_FIFO_LVL Position */
#define MXC_F_UART_CTRL1_TX_FIFO_LVL                   ((uint32_t)(0x3FUL << MXC_F_UART_CTRL1_TX_FIFO_LVL_POS)) /**< CTRL1_TX_FIFO_LVL Mask */

#define MXC_F_UART_CTRL1_RTS_FIFO_LVL_POS              16 /**< CTRL1_RTS_FIFO_LVL Position */
#define MXC_F_UART_CTRL1_RTS_FIFO_LVL                  ((uint32_t)(0x3FUL << MXC_F_UART_CTRL1_RTS_FIFO_LVL_POS)) /**< CTRL1_RTS_FIFO_LVL Mask */

/**@} end of group UART_CTRL1_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_STAT UART_STAT
 * @brief    Status Register.
 * @{
 */
#define MXC_F_UART_STAT_TX_BUSY_POS                    0 /**< STAT_TX_BUSY Position */
#define MXC_F_UART_STAT_TX_BUSY                        ((uint32_t)(0x1UL << MXC_F_UART_STAT_TX_BUSY_POS)) /**< STAT_TX_BUSY Mask */
#define MXC_V_UART_STAT_TX_BUSY_IDLE                   ((uint32_t)0x0UL) /**< STAT_TX_BUSY_IDLE Value */
#define MXC_S_UART_STAT_TX_BUSY_IDLE                   (MXC_V_UART_STAT_TX_BUSY_IDLE << MXC_F_UART_STAT_TX_BUSY_POS) /**< STAT_TX_BUSY_IDLE Setting */
#define MXC_V_UART_STAT_TX_BUSY_BUSY                   ((uint32_t)0x1UL) /**< STAT_TX_BUSY_BUSY Value */
#define MXC_S_UART_STAT_TX_BUSY_BUSY                   (MXC_V_UART_STAT_TX_BUSY_BUSY << MXC_F_UART_STAT_TX_BUSY_POS) /**< STAT_TX_BUSY_BUSY Setting */

#define MXC_F_UART_STAT_RX_BUSY_POS                    1 /**< STAT_RX_BUSY Position */
#define MXC_F_UART_STAT_RX_BUSY                        ((uint32_t)(0x1UL << MXC_F_UART_STAT_RX_BUSY_POS)) /**< STAT_RX_BUSY Mask */
#define MXC_V_UART_STAT_RX_BUSY_IDLE                   ((uint32_t)0x0UL) /**< STAT_RX_BUSY_IDLE Value */
#define MXC_S_UART_STAT_RX_BUSY_IDLE                   (MXC_V_UART_STAT_RX_BUSY_IDLE << MXC_F_UART_STAT_RX_BUSY_POS) /**< STAT_RX_BUSY_IDLE Setting */
#define MXC_V_UART_STAT_RX_BUSY_BUSY                   ((uint32_t)0x1UL) /**< STAT_RX_BUSY_BUSY Value */
#define MXC_S_UART_STAT_RX_BUSY_BUSY                   (MXC_V_UART_STAT_RX_BUSY_BUSY << MXC_F_UART_STAT_RX_BUSY_POS) /**< STAT_RX_BUSY_BUSY Setting */

