analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/uart_regs.h
#define MXC_F_UART_STAT_PARITY_POS                     2 /**< STAT_PARITY Position */
#define MXC_F_UART_STAT_PARITY                         ((uint32_t)(0x1UL << MXC_F_UART_STAT_PARITY_POS)) /**< STAT_PARITY Mask */
#define MXC_V_UART_STAT_PARITY_0                       ((uint32_t)0x0UL) /**< STAT_PARITY_0 Value */
#define MXC_S_UART_STAT_PARITY_0                       (MXC_V_UART_STAT_PARITY_0 << MXC_F_UART_STAT_PARITY_POS) /**< STAT_PARITY_0 Setting */
#define MXC_V_UART_STAT_PARITY_1                       ((uint32_t)0x1UL) /**< STAT_PARITY_1 Value */
#define MXC_S_UART_STAT_PARITY_1                       (MXC_V_UART_STAT_PARITY_1 << MXC_F_UART_STAT_PARITY_POS) /**< STAT_PARITY_1 Setting */

#define MXC_F_UART_STAT_BREAK_POS                      3 /**< STAT_BREAK Position */
#define MXC_F_UART_STAT_BREAK                          ((uint32_t)(0x1UL << MXC_F_UART_STAT_BREAK_POS)) /**< STAT_BREAK Mask */
#define MXC_V_UART_STAT_BREAK_RECV                     ((uint32_t)0x1UL) /**< STAT_BREAK_RECV Value */
#define MXC_S_UART_STAT_BREAK_RECV                     (MXC_V_UART_STAT_BREAK_RECV << MXC_F_UART_STAT_BREAK_POS) /**< STAT_BREAK_RECV Setting */

#define MXC_F_UART_STAT_RX_EMPTY_POS                   4 /**< STAT_RX_EMPTY Position */
#define MXC_F_UART_STAT_RX_EMPTY                       ((uint32_t)(0x1UL << MXC_F_UART_STAT_RX_EMPTY_POS)) /**< STAT_RX_EMPTY Mask */
#define MXC_V_UART_STAT_RX_EMPTY_EMPTY                 ((uint32_t)0x1UL) /**< STAT_RX_EMPTY_EMPTY Value */
#define MXC_S_UART_STAT_RX_EMPTY_EMPTY                 (MXC_V_UART_STAT_RX_EMPTY_EMPTY << MXC_F_UART_STAT_RX_EMPTY_POS) /**< STAT_RX_EMPTY_EMPTY Setting */

#define MXC_F_UART_STAT_RX_FULL_POS                    5 /**< STAT_RX_FULL Position */
#define MXC_F_UART_STAT_RX_FULL                        ((uint32_t)(0x1UL << MXC_F_UART_STAT_RX_FULL_POS)) /**< STAT_RX_FULL Mask */
#define MXC_V_UART_STAT_RX_FULL_FULL                   ((uint32_t)0x1UL) /**< STAT_RX_FULL_FULL Value */
#define MXC_S_UART_STAT_RX_FULL_FULL                   (MXC_V_UART_STAT_RX_FULL_FULL << MXC_F_UART_STAT_RX_FULL_POS) /**< STAT_RX_FULL_FULL Setting */

#define MXC_F_UART_STAT_TX_EMPTY_POS                   6 /**< STAT_TX_EMPTY Position */
#define MXC_F_UART_STAT_TX_EMPTY                       ((uint32_t)(0x1UL << MXC_F_UART_STAT_TX_EMPTY_POS)) /**< STAT_TX_EMPTY Mask */
#define MXC_V_UART_STAT_TX_EMPTY_EMPTY                 ((uint32_t)0x1UL) /**< STAT_TX_EMPTY_EMPTY Value */
#define MXC_S_UART_STAT_TX_EMPTY_EMPTY                 (MXC_V_UART_STAT_TX_EMPTY_EMPTY << MXC_F_UART_STAT_TX_EMPTY_POS) /**< STAT_TX_EMPTY_EMPTY Setting */

#define MXC_F_UART_STAT_TX_FULL_POS                    7 /**< STAT_TX_FULL Position */
#define MXC_F_UART_STAT_TX_FULL                        ((uint32_t)(0x1UL << MXC_F_UART_STAT_TX_FULL_POS)) /**< STAT_TX_FULL Mask */
#define MXC_V_UART_STAT_TX_FULL_FULL                   ((uint32_t)0x1UL) /**< STAT_TX_FULL_FULL Value */
#define MXC_S_UART_STAT_TX_FULL_FULL                   (MXC_V_UART_STAT_TX_FULL_FULL << MXC_F_UART_STAT_TX_FULL_POS) /**< STAT_TX_FULL_FULL Setting */

#define MXC_F_UART_STAT_RX_NUM_POS                     8 /**< STAT_RX_NUM Position */
#define MXC_F_UART_STAT_RX_NUM                         ((uint32_t)(0x3FUL << MXC_F_UART_STAT_RX_NUM_POS)) /**< STAT_RX_NUM Mask */

#define MXC_F_UART_STAT_TX_NUM_POS                     16 /**< STAT_TX_NUM Position */
#define MXC_F_UART_STAT_TX_NUM                         ((uint32_t)(0x3FUL << MXC_F_UART_STAT_TX_NUM_POS)) /**< STAT_TX_NUM Mask */

#define MXC_F_UART_STAT_RX_TO_POS                      24 /**< STAT_RX_TO Position */
#define MXC_F_UART_STAT_RX_TO                          ((uint32_t)(0x1UL << MXC_F_UART_STAT_RX_TO_POS)) /**< STAT_RX_TO Mask */
#define MXC_V_UART_STAT_RX_TO_EXPIRED                  ((uint32_t)0x1UL) /**< STAT_RX_TO_EXPIRED Value */
#define MXC_S_UART_STAT_RX_TO_EXPIRED                  (MXC_V_UART_STAT_RX_TO_EXPIRED << MXC_F_UART_STAT_RX_TO_POS) /**< STAT_RX_TO_EXPIRED Setting */

/**@} end of group UART_STAT_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_INT_EN UART_INT_EN
 * @brief    Interrupt Enable Register.
 * @{
 */
#define MXC_F_UART_INT_EN_RX_FRAME_ERROR_POS           0 /**< INT_EN_RX_FRAME_ERROR Position */
#define MXC_F_UART_INT_EN_RX_FRAME_ERROR               ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_RX_FRAME_ERROR_POS)) /**< INT_EN_RX_FRAME_ERROR Mask */
#define MXC_V_UART_INT_EN_RX_FRAME_ERROR_DIS           ((uint32_t)0x0UL) /**< INT_EN_RX_FRAME_ERROR_DIS Value */
#define MXC_S_UART_INT_EN_RX_FRAME_ERROR_DIS           (MXC_V_UART_INT_EN_RX_FRAME_ERROR_DIS << MXC_F_UART_INT_EN_RX_FRAME_ERROR_POS) /**< INT_EN_RX_FRAME_ERROR_DIS Setting */
#define MXC_V_UART_INT_EN_RX_FRAME_ERROR_EN            ((uint32_t)0x1UL) /**< INT_EN_RX_FRAME_ERROR_EN Value */
#define MXC_S_UART_INT_EN_RX_FRAME_ERROR_EN            (MXC_V_UART_INT_EN_RX_FRAME_ERROR_EN << MXC_F_UART_INT_EN_RX_FRAME_ERROR_POS) /**< INT_EN_RX_FRAME_ERROR_EN Setting */

#define MXC_F_UART_INT_EN_RX_PARITY_ERROR_POS          1 /**< INT_EN_RX_PARITY_ERROR Position */
#define MXC_F_UART_INT_EN_RX_PARITY_ERROR              ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_RX_PARITY_ERROR_POS)) /**< INT_EN_RX_PARITY_ERROR Mask */
#define MXC_V_UART_INT_EN_RX_PARITY_ERROR_DIS          ((uint32_t)0x0UL) /**< INT_EN_RX_PARITY_ERROR_DIS Value */
#define MXC_S_UART_INT_EN_RX_PARITY_ERROR_DIS          (MXC_V_UART_INT_EN_RX_PARITY_ERROR_DIS << MXC_F_UART_INT_EN_RX_PARITY_ERROR_POS) /**< INT_EN_RX_PARITY_ERROR_DIS Setting */
#define MXC_V_UART_INT_EN_RX_PARITY_ERROR_EN           ((uint32_t)0x1UL) /**< INT_EN_RX_PARITY_ERROR_EN Value */
#define MXC_S_UART_INT_EN_RX_PARITY_ERROR_EN           (MXC_V_UART_INT_EN_RX_PARITY_ERROR_EN << MXC_F_UART_INT_EN_RX_PARITY_ERROR_POS) /**< INT_EN_RX_PARITY_ERROR_EN Setting */

#define MXC_F_UART_INT_EN_CTS_POS                      2 /**< INT_EN_CTS Position */
#define MXC_F_UART_INT_EN_CTS                          ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_CTS_POS)) /**< INT_EN_CTS Mask */
#define MXC_V_UART_INT_EN_CTS_DIS                      ((uint32_t)0x0UL) /**< INT_EN_CTS_DIS Value */
#define MXC_S_UART_INT_EN_CTS_DIS                      (MXC_V_UART_INT_EN_CTS_DIS << MXC_F_UART_INT_EN_CTS_POS) /**< INT_EN_CTS_DIS Setting */
#define MXC_V_UART_INT_EN_CTS_EN                       ((uint32_t)0x1UL) /**< INT_EN_CTS_EN Value */
#define MXC_S_UART_INT_EN_CTS_EN                       (MXC_V_UART_INT_EN_CTS_EN << MXC_F_UART_INT_EN_CTS_POS) /**< INT_EN_CTS_EN Setting */

