analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/uart_regs.h
#define MXC_F_UART_INT_EN_RX_OVERRUN_POS               3 /**< INT_EN_RX_OVERRUN Position */
#define MXC_F_UART_INT_EN_RX_OVERRUN                   ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_RX_OVERRUN_POS)) /**< INT_EN_RX_OVERRUN Mask */
#define MXC_V_UART_INT_EN_RX_OVERRUN_DIS               ((uint32_t)0x0UL) /**< INT_EN_RX_OVERRUN_DIS Value */
#define MXC_S_UART_INT_EN_RX_OVERRUN_DIS               (MXC_V_UART_INT_EN_RX_OVERRUN_DIS << MXC_F_UART_INT_EN_RX_OVERRUN_POS) /**< INT_EN_RX_OVERRUN_DIS Setting */
#define MXC_V_UART_INT_EN_RX_OVERRUN_EN                ((uint32_t)0x1UL) /**< INT_EN_RX_OVERRUN_EN Value */
#define MXC_S_UART_INT_EN_RX_OVERRUN_EN                (MXC_V_UART_INT_EN_RX_OVERRUN_EN << MXC_F_UART_INT_EN_RX_OVERRUN_POS) /**< INT_EN_RX_OVERRUN_EN Setting */

#define MXC_F_UART_INT_EN_RX_FIFO_LVL_POS              4 /**< INT_EN_RX_FIFO_LVL Position */
#define MXC_F_UART_INT_EN_RX_FIFO_LVL                  ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_RX_FIFO_LVL_POS)) /**< INT_EN_RX_FIFO_LVL Mask */
#define MXC_V_UART_INT_EN_RX_FIFO_LVL_DIS              ((uint32_t)0x0UL) /**< INT_EN_RX_FIFO_LVL_DIS Value */
#define MXC_S_UART_INT_EN_RX_FIFO_LVL_DIS              (MXC_V_UART_INT_EN_RX_FIFO_LVL_DIS << MXC_F_UART_INT_EN_RX_FIFO_LVL_POS) /**< INT_EN_RX_FIFO_LVL_DIS Setting */
#define MXC_V_UART_INT_EN_RX_FIFO_LVL_EN               ((uint32_t)0x1UL) /**< INT_EN_RX_FIFO_LVL_EN Value */
#define MXC_S_UART_INT_EN_RX_FIFO_LVL_EN               (MXC_V_UART_INT_EN_RX_FIFO_LVL_EN << MXC_F_UART_INT_EN_RX_FIFO_LVL_POS) /**< INT_EN_RX_FIFO_LVL_EN Setting */

#define MXC_F_UART_INT_EN_TX_FIFO_AE_POS               5 /**< INT_EN_TX_FIFO_AE Position */
#define MXC_F_UART_INT_EN_TX_FIFO_AE                   ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_TX_FIFO_AE_POS)) /**< INT_EN_TX_FIFO_AE Mask */
#define MXC_V_UART_INT_EN_TX_FIFO_AE_DIS               ((uint32_t)0x0UL) /**< INT_EN_TX_FIFO_AE_DIS Value */
#define MXC_S_UART_INT_EN_TX_FIFO_AE_DIS               (MXC_V_UART_INT_EN_TX_FIFO_AE_DIS << MXC_F_UART_INT_EN_TX_FIFO_AE_POS) /**< INT_EN_TX_FIFO_AE_DIS Setting */
#define MXC_V_UART_INT_EN_TX_FIFO_AE_EN                ((uint32_t)0x1UL) /**< INT_EN_TX_FIFO_AE_EN Value */
#define MXC_S_UART_INT_EN_TX_FIFO_AE_EN                (MXC_V_UART_INT_EN_TX_FIFO_AE_EN << MXC_F_UART_INT_EN_TX_FIFO_AE_POS) /**< INT_EN_TX_FIFO_AE_EN Setting */

#define MXC_F_UART_INT_EN_TX_FIFO_LVL_POS              6 /**< INT_EN_TX_FIFO_LVL Position */
#define MXC_F_UART_INT_EN_TX_FIFO_LVL                  ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_TX_FIFO_LVL_POS)) /**< INT_EN_TX_FIFO_LVL Mask */
#define MXC_V_UART_INT_EN_TX_FIFO_LVL_DIS              ((uint32_t)0x0UL) /**< INT_EN_TX_FIFO_LVL_DIS Value */
#define MXC_S_UART_INT_EN_TX_FIFO_LVL_DIS              (MXC_V_UART_INT_EN_TX_FIFO_LVL_DIS << MXC_F_UART_INT_EN_TX_FIFO_LVL_POS) /**< INT_EN_TX_FIFO_LVL_DIS Setting */
#define MXC_V_UART_INT_EN_TX_FIFO_LVL_EN               ((uint32_t)0x1UL) /**< INT_EN_TX_FIFO_LVL_EN Value */
#define MXC_S_UART_INT_EN_TX_FIFO_LVL_EN               (MXC_V_UART_INT_EN_TX_FIFO_LVL_EN << MXC_F_UART_INT_EN_TX_FIFO_LVL_POS) /**< INT_EN_TX_FIFO_LVL_EN Setting */

#define MXC_F_UART_INT_EN_BREAK_POS                    7 /**< INT_EN_BREAK Position */
#define MXC_F_UART_INT_EN_BREAK                        ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_BREAK_POS)) /**< INT_EN_BREAK Mask */
#define MXC_V_UART_INT_EN_BREAK_DIS                    ((uint32_t)0x0UL) /**< INT_EN_BREAK_DIS Value */
#define MXC_S_UART_INT_EN_BREAK_DIS                    (MXC_V_UART_INT_EN_BREAK_DIS << MXC_F_UART_INT_EN_BREAK_POS) /**< INT_EN_BREAK_DIS Setting */
#define MXC_V_UART_INT_EN_BREAK_EN                     ((uint32_t)0x1UL) /**< INT_EN_BREAK_EN Value */
#define MXC_S_UART_INT_EN_BREAK_EN                     (MXC_V_UART_INT_EN_BREAK_EN << MXC_F_UART_INT_EN_BREAK_POS) /**< INT_EN_BREAK_EN Setting */

#define MXC_F_UART_INT_EN_RX_TO_POS                    8 /**< INT_EN_RX_TO Position */
#define MXC_F_UART_INT_EN_RX_TO                        ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_RX_TO_POS)) /**< INT_EN_RX_TO Mask */
#define MXC_V_UART_INT_EN_RX_TO_DIS                    ((uint32_t)0x0UL) /**< INT_EN_RX_TO_DIS Value */
#define MXC_S_UART_INT_EN_RX_TO_DIS                    (MXC_V_UART_INT_EN_RX_TO_DIS << MXC_F_UART_INT_EN_RX_TO_POS) /**< INT_EN_RX_TO_DIS Setting */
#define MXC_V_UART_INT_EN_RX_TO_EN                     ((uint32_t)0x1UL) /**< INT_EN_RX_TO_EN Value */
#define MXC_S_UART_INT_EN_RX_TO_EN                     (MXC_V_UART_INT_EN_RX_TO_EN << MXC_F_UART_INT_EN_RX_TO_POS) /**< INT_EN_RX_TO_EN Setting */

#define MXC_F_UART_INT_EN_LAST_BREAK_POS               9 /**< INT_EN_LAST_BREAK Position */
#define MXC_F_UART_INT_EN_LAST_BREAK                   ((uint32_t)(0x1UL << MXC_F_UART_INT_EN_LAST_BREAK_POS)) /**< INT_EN_LAST_BREAK Mask */
#define MXC_V_UART_INT_EN_LAST_BREAK_DIS               ((uint32_t)0x0UL) /**< INT_EN_LAST_BREAK_DIS Value */
#define MXC_S_UART_INT_EN_LAST_BREAK_DIS               (MXC_V_UART_INT_EN_LAST_BREAK_DIS << MXC_F_UART_INT_EN_LAST_BREAK_POS) /**< INT_EN_LAST_BREAK_DIS Setting */
#define MXC_V_UART_INT_EN_LAST_BREAK_EN                ((uint32_t)0x1UL) /**< INT_EN_LAST_BREAK_EN Value */
#define MXC_S_UART_INT_EN_LAST_BREAK_EN                (MXC_V_UART_INT_EN_LAST_BREAK_EN << MXC_F_UART_INT_EN_LAST_BREAK_POS) /**< INT_EN_LAST_BREAK_EN Setting */

/**@} end of group UART_INT_EN_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_INT_FL UART_INT_FL
 * @brief    Interrupt Status Flags.
 * @{
 */
#define MXC_F_UART_INT_FL_FRAME_POS                    0 /**< INT_FL_FRAME Position */
#define MXC_F_UART_INT_FL_FRAME                        ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_FRAME_POS)) /**< INT_FL_FRAME Mask */
#define MXC_V_UART_INT_FL_FRAME_ACTIVE                 ((uint32_t)0x1UL) /**< INT_FL_FRAME_ACTIVE Value */
#define MXC_S_UART_INT_FL_FRAME_ACTIVE                 (MXC_V_UART_INT_FL_FRAME_ACTIVE << MXC_F_UART_INT_FL_FRAME_POS) /**< INT_FL_FRAME_ACTIVE Setting */

