analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/uart_regs.h
#define MXC_F_UART_INT_FL_PARITY_POS                   1 /**< INT_FL_PARITY Position */
#define MXC_F_UART_INT_FL_PARITY                       ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_PARITY_POS)) /**< INT_FL_PARITY Mask */
#define MXC_V_UART_INT_FL_PARITY_ACTIVE                ((uint32_t)0x1UL) /**< INT_FL_PARITY_ACTIVE Value */
#define MXC_S_UART_INT_FL_PARITY_ACTIVE                (MXC_V_UART_INT_FL_PARITY_ACTIVE << MXC_F_UART_INT_FL_PARITY_POS) /**< INT_FL_PARITY_ACTIVE Setting */

#define MXC_F_UART_INT_FL_CTS_CHANGE_POS               2 /**< INT_FL_CTS_CHANGE Position */
#define MXC_F_UART_INT_FL_CTS_CHANGE                   ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_CTS_CHANGE_POS)) /**< INT_FL_CTS_CHANGE Mask */
#define MXC_V_UART_INT_FL_CTS_CHANGE_ACTIVE            ((uint32_t)0x1UL) /**< INT_FL_CTS_CHANGE_ACTIVE Value */
#define MXC_S_UART_INT_FL_CTS_CHANGE_ACTIVE            (MXC_V_UART_INT_FL_CTS_CHANGE_ACTIVE << MXC_F_UART_INT_FL_CTS_CHANGE_POS) /**< INT_FL_CTS_CHANGE_ACTIVE Setting */

#define MXC_F_UART_INT_FL_RX_OVR_POS                   3 /**< INT_FL_RX_OVR Position */
#define MXC_F_UART_INT_FL_RX_OVR                       ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_RX_OVR_POS)) /**< INT_FL_RX_OVR Mask */
#define MXC_V_UART_INT_FL_RX_OVR_ACTIVE                ((uint32_t)0x1UL) /**< INT_FL_RX_OVR_ACTIVE Value */
#define MXC_S_UART_INT_FL_RX_OVR_ACTIVE                (MXC_V_UART_INT_FL_RX_OVR_ACTIVE << MXC_F_UART_INT_FL_RX_OVR_POS) /**< INT_FL_RX_OVR_ACTIVE Setting */

#define MXC_F_UART_INT_FL_RX_FIFO_LVL_POS              4 /**< INT_FL_RX_FIFO_LVL Position */
#define MXC_F_UART_INT_FL_RX_FIFO_LVL                  ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_RX_FIFO_LVL_POS)) /**< INT_FL_RX_FIFO_LVL Mask */
#define MXC_V_UART_INT_FL_RX_FIFO_LVL_ACTIVE           ((uint32_t)0x1UL) /**< INT_FL_RX_FIFO_LVL_ACTIVE Value */
#define MXC_S_UART_INT_FL_RX_FIFO_LVL_ACTIVE           (MXC_V_UART_INT_FL_RX_FIFO_LVL_ACTIVE << MXC_F_UART_INT_FL_RX_FIFO_LVL_POS) /**< INT_FL_RX_FIFO_LVL_ACTIVE Setting */

#define MXC_F_UART_INT_FL_TX_FIFO_AE_POS               5 /**< INT_FL_TX_FIFO_AE Position */
#define MXC_F_UART_INT_FL_TX_FIFO_AE                   ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_TX_FIFO_AE_POS)) /**< INT_FL_TX_FIFO_AE Mask */
#define MXC_V_UART_INT_FL_TX_FIFO_AE_ACTIVE            ((uint32_t)0x1UL) /**< INT_FL_TX_FIFO_AE_ACTIVE Value */
#define MXC_S_UART_INT_FL_TX_FIFO_AE_ACTIVE            (MXC_V_UART_INT_FL_TX_FIFO_AE_ACTIVE << MXC_F_UART_INT_FL_TX_FIFO_AE_POS) /**< INT_FL_TX_FIFO_AE_ACTIVE Setting */

#define MXC_F_UART_INT_FL_TX_FIFO_LVL_POS              6 /**< INT_FL_TX_FIFO_LVL Position */
#define MXC_F_UART_INT_FL_TX_FIFO_LVL                  ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_TX_FIFO_LVL_POS)) /**< INT_FL_TX_FIFO_LVL Mask */
#define MXC_V_UART_INT_FL_TX_FIFO_LVL_ACTIVE           ((uint32_t)0x1UL) /**< INT_FL_TX_FIFO_LVL_ACTIVE Value */
#define MXC_S_UART_INT_FL_TX_FIFO_LVL_ACTIVE           (MXC_V_UART_INT_FL_TX_FIFO_LVL_ACTIVE << MXC_F_UART_INT_FL_TX_FIFO_LVL_POS) /**< INT_FL_TX_FIFO_LVL_ACTIVE Setting */

#define MXC_F_UART_INT_FL_BREAK_POS                    7 /**< INT_FL_BREAK Position */
#define MXC_F_UART_INT_FL_BREAK                        ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_BREAK_POS)) /**< INT_FL_BREAK Mask */
#define MXC_V_UART_INT_FL_BREAK_ACTIVE                 ((uint32_t)0x1UL) /**< INT_FL_BREAK_ACTIVE Value */
#define MXC_S_UART_INT_FL_BREAK_ACTIVE                 (MXC_V_UART_INT_FL_BREAK_ACTIVE << MXC_F_UART_INT_FL_BREAK_POS) /**< INT_FL_BREAK_ACTIVE Setting */

#define MXC_F_UART_INT_FL_RX_TO_POS                    8 /**< INT_FL_RX_TO Position */
#define MXC_F_UART_INT_FL_RX_TO                        ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_RX_TO_POS)) /**< INT_FL_RX_TO Mask */
#define MXC_V_UART_INT_FL_RX_TO_ACTIVE                 ((uint32_t)0x1UL) /**< INT_FL_RX_TO_ACTIVE Value */
#define MXC_S_UART_INT_FL_RX_TO_ACTIVE                 (MXC_V_UART_INT_FL_RX_TO_ACTIVE << MXC_F_UART_INT_FL_RX_TO_POS) /**< INT_FL_RX_TO_ACTIVE Setting */

#define MXC_F_UART_INT_FL_LAST_BREAK_POS               9 /**< INT_FL_LAST_BREAK Position */
#define MXC_F_UART_INT_FL_LAST_BREAK                   ((uint32_t)(0x1UL << MXC_F_UART_INT_FL_LAST_BREAK_POS)) /**< INT_FL_LAST_BREAK Mask */
#define MXC_V_UART_INT_FL_LAST_BREAK_ACTIVE            ((uint32_t)0x1UL) /**< INT_FL_LAST_BREAK_ACTIVE Value */
#define MXC_S_UART_INT_FL_LAST_BREAK_ACTIVE            (MXC_V_UART_INT_FL_LAST_BREAK_ACTIVE << MXC_F_UART_INT_FL_LAST_BREAK_POS) /**< INT_FL_LAST_BREAK_ACTIVE Setting */

/**@} end of group UART_INT_FL_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_BAUD0 UART_BAUD0
 * @brief    Baud rate register. Integer portion.
 * @{
 */
#define MXC_F_UART_BAUD0_IBAUD_POS                     0 /**< BAUD0_IBAUD Position */
#define MXC_F_UART_BAUD0_IBAUD                         ((uint32_t)(0xFFFUL << MXC_F_UART_BAUD0_IBAUD_POS)) /**< BAUD0_IBAUD Mask */

#define MXC_F_UART_BAUD0_CLKDIV_POS                    16 /**< BAUD0_CLKDIV Position */
#define MXC_F_UART_BAUD0_CLKDIV                        ((uint32_t)(0x7UL << MXC_F_UART_BAUD0_CLKDIV_POS)) /**< BAUD0_CLKDIV Mask */
#define MXC_V_UART_BAUD0_CLKDIV_DIV128                 ((uint32_t)0x0UL) /**< BAUD0_CLKDIV_DIV128 Value */
#define MXC_S_UART_BAUD0_CLKDIV_DIV128                 (MXC_V_UART_BAUD0_CLKDIV_DIV128 << MXC_F_UART_BAUD0_CLKDIV_POS) /**< BAUD0_CLKDIV_DIV128 Setting */
#define MXC_V_UART_BAUD0_CLKDIV_DIV64                  ((uint32_t)0x1UL) /**< BAUD0_CLKDIV_DIV64 Value */
#define MXC_S_UART_BAUD0_CLKDIV_DIV64                  (MXC_V_UART_BAUD0_CLKDIV_DIV64 << MXC_F_UART_BAUD0_CLKDIV_POS) /**< BAUD0_CLKDIV_DIV64 Setting */
#define MXC_V_UART_BAUD0_CLKDIV_DIV32                  ((uint32_t)0x2UL) /**< BAUD0_CLKDIV_DIV32 Value */
#define MXC_S_UART_BAUD0_CLKDIV_DIV32                  (MXC_V_UART_BAUD0_CLKDIV_DIV32 << MXC_F_UART_BAUD0_CLKDIV_POS) /**< BAUD0_CLKDIV_DIV32 Setting */
#define MXC_V_UART_BAUD0_CLKDIV_DIV16                  ((uint32_t)0x3UL) /**< BAUD0_CLKDIV_DIV16 Value */
#define MXC_S_UART_BAUD0_CLKDIV_DIV16                  (MXC_V_UART_BAUD0_CLKDIV_DIV16 << MXC_F_UART_BAUD0_CLKDIV_POS) /**< BAUD0_CLKDIV_DIV16 Setting */
#define MXC_V_UART_BAUD0_CLKDIV_DIV8                   ((uint32_t)0x4UL) /**< BAUD0_CLKDIV_DIV8 Value */
#define MXC_S_UART_BAUD0_CLKDIV_DIV8                   (MXC_V_UART_BAUD0_CLKDIV_DIV8 << MXC_F_UART_BAUD0_CLKDIV_POS) /**< BAUD0_CLKDIV_DIV8 Setting */

/**@} end of group UART_BAUD0_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_BAUD1 UART_BAUD1
 * @brief    Baud rate register. Decimal Setting.
 * @{
 */
#define MXC_F_UART_BAUD1_DBAUD_POS                     0 /**< BAUD1_DBAUD Position */
#define MXC_F_UART_BAUD1_DBAUD                         ((uint32_t)(0x7FUL << MXC_F_UART_BAUD1_DBAUD_POS)) /**< BAUD1_DBAUD Mask */

/**@} end of group UART_BAUD1_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_FIFO UART_FIFO
 * @brief    FIFO Data buffer.
 * @{
 */
#define MXC_F_UART_FIFO_FIFO_POS                       0 /**< FIFO_FIFO Position */
#define MXC_F_UART_FIFO_FIFO                           ((uint32_t)(0xFFUL << MXC_F_UART_FIFO_FIFO_POS)) /**< FIFO_FIFO Mask */

/**@} end of group UART_FIFO_Register */

/**
 * @ingroup  uart_registers
 * @defgroup UART_DMA UART_DMA
 * @brief    DMA Configuration.
 * @{
 */
#define MXC_F_UART_DMA_TXDMA_EN_POS                    0 /**< DMA_TXDMA_EN Position */
#define MXC_F_UART_DMA_TXDMA_EN                        ((uint32_t)(0x1UL << MXC_F_UART_DMA_TXDMA_EN_POS)) /**< DMA_TXDMA_EN Mask */
#define MXC_V_UART_DMA_TXDMA_EN_DIS                    ((uint32_t)0x0UL) /**< DMA_TXDMA_EN_DIS Value */
#define MXC_S_UART_DMA_TXDMA_EN_DIS                    (MXC_V_UART_DMA_TXDMA_EN_DIS << MXC_F_UART_DMA_TXDMA_EN_POS) /**< DMA_TXDMA_EN_DIS Setting */
#define MXC_V_UART_DMA_TXDMA_EN_EN                     ((uint32_t)0x1UL) /**< DMA_TXDMA_EN_EN Value */
#define MXC_S_UART_DMA_TXDMA_EN_EN                     (MXC_V_UART_DMA_TXDMA_EN_EN << MXC_F_UART_DMA_TXDMA_EN_POS) /**< DMA_TXDMA_EN_EN Setting */

